{
  "blog_posts": [
    {
      "id": "1",
      "title": "Wat is Next.js?",
      "excerpt": "Next.js is een krachtige React framework dat server-side rendering (SSR) en statische site generatie (SSG) ondersteunt.",
      "content": "Next.js is een krachtige React framework dat server-side rendering (SSR) en statische site generatie (SSG) ondersteunt, waardoor het ideaal is voor SEO en prestaties.\n\nServer-side rendering betekent dat je React componenten op de server kunt renderen voordat ze naar de browser worden gestuurd. Dit verbetert de SEO omdat zoekmachines de volledige HTML kunnen lezen.\n\nStatische site generatie betekent dat je pagina's kunt voor-renderen op build time, wat resulteert in extreem snelle laadtijden.\n\nMet Next.js kun je moderne, snelle en SEO-vriendelijke web applicaties bouwen.",
      "category": "Next.js",
      "author": "Web Developer",
      "image_url": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=800&h=400&fit=crop",
      "created_at": "2024-01-15T10:00:00Z"
    },
    {
      "id": "2",
      "title": "Waarom kiezen voor Next.js?",
      "excerpt": "Leer waarom zoveel developers Next.js kiezen voor hun applicaties: van eenvoud in routing tot geweldige prestaties.",
      "content": "Next.js is een van de meest populaire React frameworks, en daar zijn goede redenen voor. Hier zijn de belangrijkste voordelen:\n\n1. **Eenvoudige Routing**\n   Next.js heeft een bestandsgebaseerd routing systeem. Je hoeft alleen maar bestanden in de `pages` directory te plaatsen en de routing wordt automatisch gegenereerd.\n\n2. **Uitstekende Prestaties**\n   Door SSR en SSG zijn Next.js applicaties extreem snel. Gebruikers ervaren snelle laadtijden en een soepele gebruikerservaring.\n\n3. **SEO Optimalisatie**\n   Server-side rendering zorgt ervoor dat zoekmachines je content kunnen indexeren, wat resulteert in betere zoekresultaten.\n\n4. **Developer Experience**\n   Next.js biedt een geweldige developer experience met hot reloading, automatische code splitting en ingebouwde optimalisaties.",
      "category": "Development",
      "author": "Tech Blogger",
      "image_url": "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?w=800&h=400&fit=crop",
      "created_at": "2024-01-12T14:30:00Z"
    },
    {
      "id": "3",
      "title": "Hoe Next.js de gebruikerservaring verbetert",
      "excerpt": "Ontdek hoe Next.js door middel van server-side rendering de tijd tot eerste byte (TTFB) minimaliseert.",
      "content": "De gebruikerservaring is cruciaal voor het succes van elke website. Next.js verbetert deze ervaring op verschillende manieren:\n\n**Snelle Laadtijden**\nNext.js minimaliseert de Time to First Byte (TTFB) door server-side rendering. Gebruikers zien content sneller, wat resulteert in hogere betrokkenheid en lagere bounce rates.\n\n**Automatische Optimalisatie**\nNext.js optimaliseert automatisch:\n- Afbeeldingen met de ingebouwde Image component\n- JavaScript bundles met code splitting\n- CSS met automatische optimalisatie\n- Preloading van belangrijke resources\n\n**Responsive Design**\nMet Tailwind CSS en de responsive utilities van Next.js kun je websites bouwen die er geweldig uitzien op alle apparaten.",
      "category": "Performance",
      "author": "UX Expert",
      "image_url": "https://images.unsplash.com/photo-1551650975-87deedd944c3?w=800&h=400&fit=crop",
      "created_at": "2024-01-10T09:15:00Z"
    }
  ],
  "users": [
    {
      "id": "1",
      "email": "demo@example.com",
      "name": "Demo User",
      "role": "admin"
    }
  ]
}
